КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="24954df4-97a3-4c21-b4c7-d26d53fc581c">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0aeb3cc1-b98d-4a23-b4e7-ca886f1d7760">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f6c7649-03f7-4531-a0ff-667746572c89">
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="52009dd6-b878-4140-8aa7-3132443e38b5">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16083496-4922-46b4-8923-8a616d3a38f5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8c326d07-bde5-4de9-8ee9-7b0cbeb425dc">
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5e644ba4-eb16-4e44-abc3-e9875c22d963">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e61e315d-0201-4170-9434-0ecf2df4acca">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c79e41c6-36a3-439d-981c-102d63e2edaf">
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7bbbdf9-af5c-46a4-a3dd-22f29c629580">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7cdfa19-1cf0-4569-a223-9978a628fd33">
    <name>Доставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="41585b49-2c94-42a7-8519-f20e33a5384a">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="34979ae1-b89c-4773-8859-a4bb141a1b6c">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a493f73d-fd31-432a-9c3b-3850248a88de">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="787263e8-8b37-4909-8ba3-ceb64a99e45a">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dc773a0d-fdfb-426d-9bc6-c8aef6f0cc48">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7e29b35c-2b97-4448-a6ac-4a100b369ab7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="77116461-ac9f-4a9c-add9-f1b6a101b5a0">
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1745080b-8b4c-4748-99c3-ee4ecd0743af">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="100844ba-e7f4-4f4c-8d88-1f862d0ccc04">
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="59d49912-6073-4437-8cee-07c5891a5d03">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d2a871c2-64f0-4de9-a25b-99fbc44b3007">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="407a3120-812f-4f00-b668-45965e45579a">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3309a46c-baca-46cf-805a-d96882210186">
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="66ac4c48-937a-4783-8732-8cf4af34a45e">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26c6d2d9-2f9f-4ae8-8d9b-f428e45c55d2">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cbd47db1-d106-4953-94ba-cc0896cffd60">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d07e4b33-386b-4ebb-9e43-704b751106cd">
      <name>Основание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/ДополнительнаяИнформацияПоДоставке/ДополнительнаяИнформацияПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительнаяИнформацияПоДоставке</name>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c0a070a8-fff5-49fe-8c9e-3fbae30394cb">
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8352fa6-99c0-4f4b-9227-b1ac7d158a3e">
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4259c461-12b1-4f3e-8283-5927c75afdb6">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ce59e7d4-ce32-4e73-8b06-cda594aec2b3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2629d638-1c9b-4112-b68e-0560bb2d997b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="21ef8fb5-99ad-409e-9d21-398379db456f">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a9a6552a-9493-4353-953b-2f7c777b2f61">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07295009-77c8-4b40-8a9e-62debe0887c6">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказНаВнутреннееПотребление/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы
	
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокАдресовДоставки();
	
	Если Объект.Основания.Количество() > 1 Тогда
		Элементы.СтраницыОснование.ТекущаяСтраница = Элементы.СтраницаОснования;
		НадписьЗаголовокОснования = "Всего оснований: " + Объект.Основания.Количество();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОД_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);

	КонецЕсли;

	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы
	
&НаКлиенте
Процедура ОД_ТоварыПриИзмененииПосле(Элемент)

	ЗаполнитьСписокАдресовДоставки();

КонецПроцедуры

&НаКлиенте
Процедура ОД_НадписьЗаголовокОснованияНажатиеПосле(Элемент, СтандартнаяОбработка)

	СписокДокументов = Новый СписокЗначений;
	Для каждого Т Из Объект.Основания Цикл
		СписокДокументов.Добавить(Т.Основание);
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму(
		"ОбщаяФорма.ПросмотрСпискаДокументов",
		Новый Структура("СписокДокументов, Заголовок",
			СписокДокументов,
			НСтр("ru='Документы (%КоличествоДокументов%)'")
		),
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

Функция ВалютаРегламентированногоУчета()

	Возврат Константы.ВалютаРегламентированногоУчета.Получить();

КонецФункции // ()

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", Истина);
	ПараметрыФормы.Вставить("НалогообложениеНДС", ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС"));
	ПараметрыФормы.Вставить("ВернутьМногооборотнуюТару", Ложь);
	ПараметрыФормы.Вставить("Соглашение", Неопределено);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Валюта", ВалютаРегламентированногоУчета());
	
	ОткрытьФорму(
		"Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	
КонецПроцедуры
	
#КонецОбласти

#Область Доставка

Функция  ПолучитьКонтрагента(п_Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции // ()

Процедура ЗаполнитьСписокАдресовДоставки()

	Элементы.АдресДоставки.СписокВыбора.Очистить();
	Если Объект.Товары.Количество() > 0 Тогда
		Партнер = Объект.Товары[0].АналитикаРасходов;
		Если ТипЗнч(Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
			Контрагент = ПолучитьКонтрагента(Партнер);
			АдресаПолучателяИзКонтактнойИнформации = ОД_Логистика.ФактАдресаКонтрагента(Контрагент);
			Для Каждого Стр Из АдресаПолучателяИзКонтактнойИнформации Цикл
				Элементы.АдресДоставки.СписокВыбора.Добавить(Стр.АдресДоставки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция АдресаПолучателяИзКонтактнойИнформации(п_Партнер)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС_ДополнительнаяИнформация
		|		ПО КонтактнаяИнформация.Представление = РС_ДополнительнаяИнформация.АдресДоставки
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И НЕ ЕСТЬNULL(РС_ДополнительнаяИнформация.НеАктуален, ЛОЖЬ)");
		
	Запрос.УстановитьПараметр("ПолучательОтправитель", п_Партнер);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции


#КонецОбласти

#Область Вспомогательные

Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого Т Из ТоварыИзХранилища Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т,,"КодСтроки");
		
		Если ЗначениеЗаполнено(Т.СтатьяРасходовАктивов) Тогда
			НоваяСтрока.СтатьяРасходов = Т.СтатьяРасходовАктивов;
		Иначе
			НоваяСтрока.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Рекламация", Истина);
		КонецЕсли;
		
		НоваяСтрока.ТипСтатьи = 1;
		НоваяСтрока.СкладОбязателен = 1;
		НоваяСтрока.ДатаОтгрузкиОбязательна = 1;
		НоваяСтрока.ДатаОтгрузки = Объект.ДатаОтгрузки;
		
		ДокументОснование = "";
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			ДокументОснование = Объект.ДокументОснование;
		ИначеЕсли Объект.Основания.Количество() > 0 Тогда
			ДокументОснование = Объект.Основания[0].Основание;
		КонецЕсли;

		Если ЗначениеЗаполнено(Т.Аналитика) Тогда
			НоваяСтрока.АналитикаРасходов = Т.Аналитика;
		Иначе
			Партнер = "";
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				Партнер = ДокументОснование.Партнер;
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Ремонт")
					И ЗначениеЗаполнено(ДокументОснование.ПартнерОсуществляетРемонт) Тогда
					Партнер = ДокументОснование.ПартнерОсуществляетРемонт;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.АналитикаРасходов = Партнер;
		КонецЕсли;
		
	КонецЦикла;

	ОД_ЗаполнитьОбеспечениеЗаказа();
	
КонецПроцедуры

Процедура ОД_ЗаполнитьОбеспечениеЗаказа()

	ПереченьВариантов = Новый Массив();
	ПереченьВариантов.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить);
	ПереченьВариантов.Добавить(Перечисления.ВариантыОбеспечения.Требуется);

	ИндексыСтрок = Новый Массив;
	Для каждого Т Из Объект.Товары Цикл
		ИндексыСтрок.Добавить(Т.НомерСтроки - 1);
	КонецЦикла; 
	
	МенеджерДокумента = Документы.ЗаказНаВнутреннееПотребление;

	Объект.НеОтгружатьЧастями = Ложь;

	ПараметрыЗаполнения = МенеджерДокумента.ПараметрыВыбораОбеспечения(Объект.Статус);
	ТаблицаОбеспечения = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспеченияДокумента(
		Объект, ПереченьВариантов, ПараметрыЗаполнения, ИндексыСтрок);

	МенеджерДокумента.ЗаполнитьВариантОбеспечения(Объект, ЭтаФорма, "ИндексыСтрок", ТаблицаОбеспечения);
	
КонецПроцедуры

#КонецОбласти
